# RbsCurvetypeDefaultCrossParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsCurvetypeDefaultCrossParam Property
ParameterTypeId Class See Also
---
"Cross"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsCurvetypeDefaultCrossParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsCurvetypeDefaultCrossParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsCurvetypeDefaultCrossParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace